ObidjonovM/codes_for_mikrocontrollers/ESP_socket_3x/ESP8266_D1_mini_Socket_3x_M1_V1/src/main.cpp
////////////////////////// EEPROM functions///////////////////////////////////////////////////
byte fieldLen;
char ch;
String readFromEEPROM(int stPos) {
  String result;

  // reading the field length from the memory
  EEPROM.get(stPos, fieldLen);

  // reading the field from the memory
  for (int i = stPos + 1; i <= stPos + fieldLen; i++) {
    EEPROM.get(i, ch);
    result += ch;
  }

  return result;
}

bool writeEEPROM(String txt, int stPos) {
  // save the text length to memory
  byte txtLen = byte(txt.length());
  EEPROM.put(stPos, txtLen);

  // save the text to memeory
  for (int i = 1; i <= txtLen; i++) {
    EEPROM.put(stPos + i, char(txt[i - 1]));
    fidoDelay(10);
  }

  return EEPROM.commitReset();
}

void loadCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // reading stamp value
  int startPos = OFFSET;
  stamp = readFromEEPROM(startPos);
  if (stamp == STAMP) {
    // reading apLogin value
    startPos += stamp.length() + 1;
    apLogin = readFromEEPROM(startPos);

    // reading measureStamp value
    startPos += apLogin.length() + 1;
    measureStamp = readFromEEPROM(startPos);

    if (measureStamp == MEASURE_STAMP) {
      // reading slaveServer value
      startPos += measureStamp.length() + 1;
      slaveServer = readFromEEPROM(startPos);

      // reading measureDelay value
      startPos += slaveServer.length() + 1;
      String measure_delay = readFromEEPROM(startPos);
      measureDelay = measure_delay.toInt();

      // reading connReistTrails value
      startPos += measure_delay.length() + 1;
      String conn_reist_trails = readFromEEPROM(startPos);
      connReistTrails = conn_reist_trails.toInt();

      // reading minDelay value
      startPos += conn_reist_trails.length() + 1;
      String min_delay = readFromEEPROM(startPos);
      minDelay = min_delay.toInt();

      // reading numDelays value
      startPos += min_delay.length() + 1;
      String num_delays = readFromEEPROM(startPos);
      numDelays = num_delays.toInt();

      // reading routerLogin value
      startPos += num_delays.length() + 1;
      routerLogin = readFromEEPROM(startPos);

    } else {
      // reading routerLogin value
      routerLogin = readFromEEPROM(startPos);
    }

    // reading routerPass value
    startPos += routerLogin.length() + 1;
    routerPass = readFromEEPROM(startPos);

    if (routerPass == ROUTER_PASS) {
      routerPass = "";
    }

    EEPROM.end();
  } else {
    // assigning default values to authorization variables
    apLogin = AP_LOGIN;

    // writing stamp
    startPos = OFFSET;
    stamp = STAMP;
    writeEEPROM(stamp, startPos);

    // writting apLogin
    startPos += stamp.length() + 1;
    writeEEPROM(apLogin, startPos);

    EEPROM.end();
    ESP.reset();
  }
}

void saveCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // writing stamp
  int startPos = OFFSET;
  stamp = STAMP;
  writeEEPROM(stamp, startPos);

  // writting apLogin
  startPos += stamp.length() + 1;
  writeEEPROM(apLogin, startPos);

  if (measureStamp == MEASURE_STAMP) {
    // writting measureStamp
    startPos += apLogin.length() + 1;
    writeEEPROM(measureStamp, startPos);

    // writting slaveServer
    startPos += measureStamp.length() + 1;
    writeEEPROM(slaveServer, startPos);

    // writting measureDelay
    startPos += slaveServer.length() + 1;
    String measure_delay = String(measureDelay);
    writeEEPROM(measure_delay, startPos);

    // writting connReistTrails
    startPos += measure_delay.length() + 1;
    String conn_reist_trails = String(connReistTrails);
    writeEEPROM(conn_reist_trails, startPos);

    // writting minDelay
    startPos += conn_reist_trails.length() + 1;
    String min_delay = String(minDelay);
    writeEEPROM(min_delay, startPos);

    // writting numDelays
    startPos += min_delay.length() + 1;
    String num_delays = String(numDelays);
    writeEEPROM(num_delays, startPos);

    // writing routerLogin
    startPos += num_delays.length() + 1;
    writeEEPROM(routerLogin, startPos);
  } else {
    // writing routerLogin
    startPos += apLogin.length() + 1;
    writeEEPROM(routerLogin, startPos);
  }

  // writing routerPass
  startPos += routerLogin.length() + 1;
  writeEEPROM(routerPass, startPos);

  EEPROM.end();
}

void setup() {
  pinMode(SAPS_BTN_PIN, INPUT);
  pinMode(TURN_BTN_PIN, INPUT);
  pinMode(LED_PIN, OUTPUT);
  pinMode(REL_PIN0, OUTPUT);
  pinMode(REL_PIN1, OUTPUT);
  pinMode(REL_PIN2, OUTPUT);
  digitalWrite(REL_PIN0, LOW);
  digitalWrite(REL_PIN1, LOW);
  digitalWrite(REL_PIN2, LOW);
  fidoDelay(500);

  WiFi.disconnect();
  fidoDelay(1000);
  WiFi.softAPdisconnect(true);
  fidoDelay(2000);
  loadCredentials();
  fidoDelay(2000);
  WiFi.mode(WIFI_STA);
  WiFi.begin(routerLogin.c_str(), routerPass.c_str());
  fidoDelay(500);
}

String replaceASCIICode(String txt) {
  String result;
  unsigned int idx = 0;

  while (idx < txt.length()) {
    if (txt[idx] == '%') {
      String numString = "0x" + String(txt[idx + 1]) + String(txt[idx + 2]);
      char ch = (char)(int)strtol(numString.c_str(), NULL, 16);
      result += ch;
      idx += 3;
    } else if (txt[idx] == '+') {
      result += " ";
      idx += 1;
    }
    else {
      result += txt[idx];
      idx += 1;
    }
  }

  return result;
}

String getFieldValue(String txt, String fieldName) {
  if (txt == "") {
    return "";
  }
  int sp = txt.indexOf(fieldName);
  if (sp == -1) {
    return "";
  }
  int ep = txt.indexOf("&", sp);
  if (ep == -1) {
    return replaceASCIICode(txt.substring(sp + fieldName.length() + 1));
  }
  return replaceASCIICode(txt.substring(sp + fieldName.length() + 1, ep));
}

void handleRouter() {
  String postBody = server.arg("plain");
  if (postBody.length() > 0) {
    routerLogin = getFieldValue(postBody, "ssid");
    routerPass = getFieldValue(postBody, "routerPass");
    if (routerPass == "") {
      routerPass = ROUTER_PASS;
    }
    if (routerLogin != "" && routerPass != "") {
      saveCredentials();
      ESP.reset();
    }
  } else {
    writeScanNetworks();
    server.send(200, "text/html", routerHTML());
  }
}

void startHTTPServer() {
  server.on("/", handleRouter);
  fidoDelay(10);
  server.begin();
}

void setupAccessPoint() {
  bool apActivated = false;
  while (!apActivated) {
    apActivated = WiFi.softAP(apLogin, "", CHANNEL);
    fidoDelay(10);
  }
}

void startAPAndServer() {
  int sapsCounter = 0;

